emacs/config.org
#+TITLE: GNU Emacs Config
#+AUTHOR: Andres Osorio
#+DESCRIPTION: Personal Emacs Config.
#+STARTUP: overview
#+OPTIONS: toc:2

* TABLE OF CONTENTS :toc:
- [[#init][INIT]]
  - [[#daemon-client-rel][DAEMON-CLIENT REL]]
- [[#package-manager][PACKAGE MANAGER]]
- [[#org][ORG]]
  - [[#modern][MODERN]]
  - [[#tempo][TEMPO]]
- [[#sane-defaults][SANE DEFAULTS]]
- [[#theme][THEME]]
- [[#shell][SHELL]]
- [[#disabled-commands][DISABLED COMMANDS]]
- [[#keybindings][KEYBINDINGS]]
- [[#lsp][LSP]]
  - [[#jsts][JS+TS]]

* INIT
** DAEMON-CLIENT REL

#+begin_src bash :tangle no
  # enable emacs daemon
  systemctl --user enable emacs.service

  # disable emacs daemon
  systemctl --user disable emacs.service

  # manually start daemon
  systemctl --user start emacs.service

  # manually stop daemon
  systemctl --user stop emacs.service

  # check status
  systemctl --user status emacs.service
  ps aux | grep emacs # should see something like `emacs --fg-daemon`

  # set aliases for emacsclient
  alias ec='emacsclient -n -r -a ""'
  alias emacs='ec'
#+end_src

* PACKAGE MANAGER

#+begin_src emacs-lisp
  (require 'package)

  (add-to-list 'package-archives
               '("melpa" . "https://melpa.org/packages/")
               t)

  (require 'use-package)

  (setq use-package-always-ensure t)
#+end_src

* ORG
** MODERN
#+begin_src emacs-lisp
  (use-package org-modern
    :hook (org-mode . org-modern-mode))
#+end_src

#+begin_src emacs-lisp
  (use-package toc-org
    :hook (org-mode . toc-org-mode))
#+end_src

#+begin_src emacs-lisp
  (add-hook 'org-mode-hook #'org-indent-mode)
#+end_src

** TEMPO

#+begin_src emacs-lisp
  (require 'org-tempo)
#+end_src

* SANE DEFAULTS

#+begin_src emacs-lisp
  (setq
   ;; The customize system in Emacs provides a user-friendly way to configure settings without directly editing init.el.
   ;; However, can't easily be disabled, so discard its contents.
   custom-file "/dev/null"

   ;; No backup files, please
   make-backup-files nil

   ;; Disable auto-save
   auto-save-default nil

   ;; Inhibit startup dashboard
   inhibit-startup-message t

   ;; Flash the UI instead of beeping
   visible-bell t
   )

  ;; Disable visible scrollbar
  (scroll-bar-mode -1)

  ;; Disable the toolbar
  (tool-bar-mode -1)

  ;; Disable the menu bar
  (menu-bar-mode -1)

  ;; Show line numbers
  (global-display-line-numbers-mode 1)

  ;; Show column number on mode line
  (column-number-mode 1)

  ;; Very nice smooth scrolling on modern Emacs.
  (pixel-scroll-precision-mode 1)

  ;; Fullscreen on init
  ;;(add-to-list 'initial-frame-alist '(fullscreen . maximized))

  ;; Set frame dimensions on init and subsequent frames created
  (setq initial-frame-alist
        '((width . 150)
          (height . 50))

        default-frame-alist initial-frame-alist)

  (setq-default
   ;; Tabs to spaces
   indent-tabs-mode nil
   tab-width 2)
#+end_src

* THEME

#+begin_src emacs-lisp
  (load-theme 'wombat)
#+end_src

* SHELL

#+begin_src emacs-lisp
  (add-hook 'shell-mode-hook
            (lambda ()
              (display-line-numbers-mode 0)))
#+end_src

* DISABLED COMMANDS

#+begin_src emacs-lisp
  (put 'narrow-to-region 'disabled nil)
  (put 'upcase-region 'disabled nil)
#+end_src

* KEYBINDINGS

#+begin_src emacs-lisp
  (keymap-global-unset "C-x C-f")
  (keymap-global-set "C-x f" 'find-file)
  (keymap-global-set "C-x C-b" 'buffer-menu)
#+end_src

* LSP
** JS+TS

Install js/ts server:

#+begin_src bash :tangle no
  npm i -g @vtsls/language-server
  npm list -g
#+end_src

Eglot Setup:

#+begin_src emacs-lisp
  (use-package eglot
    :ensure nil
    :hook ((js-ts-mode
            typescript-ts-mode
            tsx-ts-mode) . eglot-ensure)
    :config
    (add-to-list 'eglot-server-programs
                 '((js-ts-mode
                    typescript-ts-mode
                    tsx-ts-mode)
                   . ("/home/andres/.asdf/shims/vtsls" "--stdio"))))
#+end_src

Declare file-mode associations:

#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.ts\\'" . typescript-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.js\\'" . js-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.tsx\\'" . tsx-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.jsx\\'" . tsx-ts-mode))
#+end_src

Handle cases where older non–Tree-sitter modes activate (many packages/file associations may default to them):

#+begin_src emacs-lisp
  (add-to-list 'major-mode-remap-alist
               '(javascript-mode . js-ts-mode))

  (add-to-list 'major-mode-remap-alist
               '(typescript-mode . typescript-ts-mode))

  (add-to-list 'auto-mode-alist '("\\.tsx\\'" . tsx-ts-mode))
#+end_src

